## 什么是数据类型
'''

    int         1,2,3 用于计算

    bool        True, False, 用户判断

    str         存储少量数据，进行操作
                'sfafafda' '二哥'， '`12345`', 'dafdafdafj'
                '战三，李四，王二麻子....'

    list        储存大量的数据。
                [1, 2, 3, 4, '吉恩', '125524552', [1,2,3,5,6]]

    元祖        只读。
                (1, 2, 3, '第三方')

    dict        字典
                字典{'name': '吉恩', 'age': 16 }
                字典{'吉恩': [], 'cc': [200, 200, 200, ......] }

    集合        {1, 2, 34, 'asdf'}
'''
